#include "struct.h"

//首页界面
void Index()
{
	printf("\n\n");
	printf("\t*************************************************************\n");
	printf("\t**                  广州商学院学生选课系统-首页            **\n");
	printf("\t*************************************************************\n");
	printf("\t**                1.学生登录                               **\n");
	printf("\t**                2.管理员登录                             **\n");
	printf("\t**                3.退出系统                               **\n");
	printf("\t-------------------------------------------------------------\n");
	printf("\t请选择服务类别:");
}

//管理端菜单界面
void Index_M_Index()
{
	printf("\t*************************************************************\n");
	printf("\t**            广州商学院学生选课系统-管理员端              **\n");
	printf("\t*************************************************************\n");
	printf("\t**                1.学生管理                               **\n");
	printf("\t**                2.课程管理                               **\n");
	printf("\t**                3.返回上页                               **\n");
	printf("\t**                4.退出                                   **\n");
	printf("\t-------------------------------------------------------------\n");
	printf("\n\t请输入选择:");
}

//学生端菜单界面
void Index_S_Index()
{
	printf("\n");
	printf("\t*************************************************************\n");
	printf("\t**             广州商学院学生选课系统-学生端               **\n");
	printf("\t*************************************************************\n");
	printf("\t                    1.学生选课                               \n");
	printf("\t                    2.课程浏览                               \n");
	printf("\t                    3.课程查询                               \n");
	printf("\t                    4.返回首页                               \n");
	printf("\t                    5.退出                                   \n");
	printf("\t-------------------------------------------------------------\n");
	printf("请输入您的选择:");
}
